Repository: Liis17/Hako
Catalog: macos/Hako/Hako/Localizable.xcstrings
Source language: ru
Languages: en

source: Не удалось запустить сборку
en: Could Not Launch Instance

source: Сборка больше не существует.
en: The instance no longer exists.

source: %.2f ГиБ
en: %.2f GiB

source: %@ будет перемещён в корзину.
en: %@ will be moved to the Trash.

source: %@ будет перемещён в корзину. Моды, зависящие от Fabric API, могут больше не давать игре запуститься.
en: %@ will be moved to the Trash. Mods that depend on Fabric API may prevent the game from starting.

# %@ из %@
source: %1$@ из %2$@
en: %1$@ of %2$@

source: %@ окна в пикселях
en: Window %@ in pixels

# %@ уже существует в мире «%@» сборки «%@».
source: %1$@ уже существует в мире «%2$@» сборки «%3$@».
en: %1$@ already exists in the world “%2$@” of instance “%3$@”.

# %@ уже существует в сборке «%@».
source: %1$@ уже существует в сборке «%2$@».
en: %1$@ already exists in the instance “%2$@”.

source: %@ — рекомендуется
en: %@ — recommended

source: %lld мин
en: %lld min

source: %lld сборок
en: %lld instances

source: %lld сборок · ~/.hako
en: %lld instances · ~/.hako

# %lld ч %lld мин
source: %1$lld ч %2$lld мин
en: %1$lld h %2$lld min

source: -Xmx и MaxHeapSize из аргументов заменяются лимитом ползунка при запуске.
en: -Xmx and MaxHeapSize in the arguments are replaced by the slider limit at launch.

source: 0 Б
en: 0 B

source: 0 мин
en: 0 min

source: 3D-модель скина Minecraft
en: 3D model of the Minecraft skin

source: Client ID не одобрен Mojang для Minecraft API. Заявка: aka.ms/mce-reviewappid
en: The Client ID is not approved by Mojang for the Minecraft API. Application: aka.ms/mce-reviewappid

source: Fabric API %@ требует другой версии Loader или Java. Текущая версия сохранена.
en: Fabric API %@ requires a different Loader or Java version. The current version was kept.

source: Fabric API %@ требует другую версию Java или Fabric Loader.
en: Fabric API %@ requires a different Java or Fabric Loader version.

# Fabric API %@%@ установится автоматически.
source: Fabric API %1$@%2$@ установится автоматически.
en: Fabric API %1$@%2$@ will be installed automatically.

source: Fabric API заранее скачивается в кэш для проверки совместимости. Установка сборки начнётся после сохранения.
en: Fabric API is downloaded to the cache in advance to check compatibility. The instance will start installing after you save it.

source: Fabric API несовместим с выбранным Loader или Java.
en: Fabric API is incompatible with the selected Loader or Java.

source: Hako на GitHub
en: Hako on GitHub

source: Java, игра и загрузчик установятся в фоне.
en: Java, the game and the loader will be installed in the background.

source: Minecraft завершился с кодом %d. Подробности — в журнале запуска.
en: Minecraft exited with code %d. See the launch log for details.

source: Minecraft не подключён
en: Minecraft not connected

source: Minecraft-сессия изменилась или завершилась. Повторите запуск.
en: The Minecraft session changed or ended. Launch again.

source: Minecraft-сессия недоступна. Повторите подключение аккаунта.
en: The Minecraft session is unavailable. Reconnect your account.

source: Minecraft: Java Edition недоступен для этого аккаунта.
en: Minecraft: Java Edition is not available for this account.

source: Mojang не предоставляет клиент этой версии.
en: Mojang does not provide a client for this version.

source: Mojang не предоставляет файлы библиотеки %@ для этой версии.
en: Mojang does not provide files of the %@ library for this version.

source: Offline-mode не рекомендуется. Часть серверов может быть недоступна. Рекомендуется вход с аккаунтом Minecraft.
en: Offline mode is not recommended. Some servers may be unavailable. Signing in with a Minecraft account is recommended.

source: Vanilla — без загрузчика
en: Vanilla — no loader

source: Xbox Live недоступен в вашей стране.
en: Xbox Live is not available in your country.

source: Xbox Live отклонил вход (код %@).
en: Xbox Live declined the sign-in (code %@).

source: Аккаунту нужно подтверждение возраста на xbox.com.
en: The account needs age verification on xbox.com.

# Активно %lld из %lld
source: Активно %1$lld из %2$lld
en: %1$lld of %2$lld active

source: Активность %@
en: Enable %@

source: Альфа недоступна
en: Alpha Unavailable

source: Аргументы Java
en: Java Arguments

source: Аргументы Minecraft
en: Minecraft Arguments

source: Аргументы запуска Java
en: Java Launch Arguments

source: Аргументы запуска Minecraft
en: Minecraft Launch Arguments

source: Аргументы и память наследуются из текущих настроек лаунчера.
en: Arguments and memory are inherited from the current launcher settings.

source: Аргументы, память и путь Java для сборок с глобальными параметрами. Настройки окна служат начальными только при создании сборки. Изменения сохраняются автоматически.
en: Arguments, memory and Java path for instances that use global parameters. Window settings are only used as defaults when creating an instance. Changes are saved automatically.

source: Архитектура выбранной Java не соответствует процессору Mac и библиотекам сборки.
en: The architecture of the selected Java doesn't match the Mac's processor and the instance libraries.

source: Бета недоступна
en: Beta Unavailable

source: Библиотека Fabric отсутствует. Повторите установку сборки.
en: A Fabric library is missing. Reinstall the instance.

source: Будет переименована папка с файлами этой сборки в ~/.hako.
en: The folder with this instance's files in ~/.hako will be renamed.

source: В Fabric API отсутствует fabric.mod.json.
en: Fabric API has no fabric.mod.json.

source: В библиотеке игры обнаружена недопустимая ссылка.
en: A game library contains an invalid link.

source: В датапаке «%@» нет корректного pack.mcmeta.
en: The data pack “%@” does not contain a valid pack.mcmeta.

source: В игре: %@
en: Played: %@

source: В комплекте Java отсутствует исполняемый файл.
en: The Java bundle has no executable.

source: В описании Fabric API отсутствует проверяемый JAR-файл.
en: The Fabric API description has no verifiable JAR file.

source: В описании Java отсутствует файл загрузки.
en: The Java description has no download file.

source: В описании Java отсутствует цель ссылки.
en: The Java description has no link target.

source: В описании библиотеки отсутствует путь.
en: The library description has no path.

source: В описании версии отсутствует главный класс Minecraft.
en: The version description has no Minecraft main class.

source: В очереди
en: Queued

source: В сборке пока нет модов.
en: This instance has no mods yet.

source: В этом мире пока нет датапаков.
en: This world has no datapacks yet.

source: Введите от 1 до 60 символов: латинские буквы, цифры и пробелы.
en: Enter 1 to 60 characters: Latin letters, digits and spaces.

source: Введите целое число больше 0
en: Enter a whole number greater than 0

source: Введите целые размеры окна больше 0.
en: Enter whole window dimensions greater than 0.

source: Версии не найдены.
en: No versions found.

source: Версия
en: Version

# Версия %@ · сборка %@
source: Версия %1$@ · сборка %2$@
en: Version %1$@ · build %2$@

source: Версия Fabric Loader
en: Fabric Loader Version

source: Версия Minecraft
en: Minecraft Version

source: Версия неизвестна
en: Unknown version

source: Включить датапак «%@»
en: Enable datapack “%@”

source: Включён
en: Enabled

source: Возможна несовместимость
en: Possible Incompatibility

source: Войдите в Minecraft или включите offline-mode.
en: Sign in to Minecraft or turn on offline mode.

source: Войти в Microsoft
en: Sign In with Microsoft

source: Время в Minecraft
en: Time in Minecraft

source: Все
en: All

source: Все сборки
en: All Instances

source: Всего
en: Total

source: Вход в Microsoft
en: Microsoft Sign-In

source: Вход отклонён на странице Microsoft.
en: Sign-in was declined on the Microsoft page.

source: Входим в Xbox Live и Minecraft…
en: Signing in to Xbox Live and Minecraft…

source: Вы продолжили без аккаунта
en: You continued without an account

source: Выберите JAR-файл мода.
en: Choose a mod JAR file.

source: Выберите ZIP-файл или папку ресурспака.
en: Choose a resource pack ZIP file or folder.

source: Выберите версию Fabric Loader.
en: Choose a Fabric Loader version.

source: Выберите версию Minecraft — Hako загрузит Java и файлы игры.
en: Choose a Minecraft version — Hako will download Java and the game files.

source: Выберите файл java в папке bin установленной Java.
en: Choose the java file in the bin folder of an installed Java.

source: Выбор Java
en: Choose Java

source: Выбранные скриншоты (%lld) будут перемещены в корзину.
en: The selected screenshots (%lld) will be moved to the Trash.

source: Выбрано более 70% памяти. Java может повлиять на работу других приложений и системы.
en: Selected memory is above 70%. Java may affect other apps and the system.

source: Выбрано: %lld
en: Selected: %lld

source: Выбрать
en: Choose

source: Выбрать…
en: Choose…

source: Выживание
en: Survival

source: Выйти
en: Sign Out

source: Выйти без переименования
en: Quit Without Renaming

source: Выйти из аккаунта?
en: Sign Out?

source: Высота
en: Height

source: Глобальные аргументы не заданы. Рекомендуется использовать параметры Mojang.
en: Global arguments are not set. Using Mojang parameters is recommended.

source: Готова
en: Ready

source: Готово
en: Done

source: Данные входа будут удалены с этого Mac. Чтобы вернуться, понадобится снова войти по коду.
en: Sign-in data will be removed from this Mac. To come back, you'll need to sign in with a code again.

source: Данные входа недоступны. Войдите в Microsoft повторно.
en: Sign-in data is unavailable. Sign in to Microsoft again.

source: Дата последней игры неизвестна
en: Last played date unknown

source: Датапак «%@» добавлен. Он будет доступен при следующем открытии мира.
en: Data pack “%@” added. It will be available the next time you open the world.

source: Датапаки
en: Datapacks

source: Датапаки с Modrinth
en: Data packs from Modrinth

source: Действия с миром
en: World actions

source: Действия с миром «%@»
en: Actions for world “%@”

source: Действия с файлом
en: File Actions

source: Действия со сборкой
en: Instance Actions

source: Детский аккаунт: взрослый должен добавить его в семью Microsoft.
en: Child account: an adult must add it to a Microsoft family.

source: Диск с данными Hako
en: Hako data disk

source: Для Minecraft %@ ещё нет совместимого Fabric API. Выберите другую версию Minecraft или Vanilla.
en: There is no compatible Fabric API for Minecraft %@ yet. Choose another Minecraft version or Vanilla.

source: Для онлайн-запуска подключите аккаунт Microsoft с Minecraft: Java Edition. Offline-mode включается отдельно в настройках каждой сборки.
en: To play online, connect a Microsoft account with Minecraft: Java Edition. Offline mode is turned on separately in each instance's settings.

# Для работы «%@» в мире «%@» сборки «%@» нужны:
source: Для работы «%1$@» в мире «%2$@» сборки «%3$@» нужны:
en: “%1$@” requires these projects in the world “%2$@” of instance “%3$@”:

# Для работы «%@» в сборке «%@» нужны:
source: Для работы «%1$@» в сборке «%2$@» нужны:
en: “%1$@” in the instance “%2$@” requires:

source: Для этой версии Minecraft требуется Java %lld или новее. Выбранная Java не подходит.
en: This Minecraft version requires Java %lld or later. The selected Java is not suitable.

source: Для этой версии отсутствуют подходящие библиотеки macOS.
en: There are no suitable macOS libraries for this version.

# Для этой версии требуется Java %lld, которую Mojang не предоставляет для %@.
source: Для этой версии требуется Java %1$lld, которую Mojang не предоставляет для %2$@.
en: This version requires Java %1$lld, which Mojang doesn't provide for %2$@.

source: Добавить
en: Add

source: Добавить «%@»
en: Add “%@”

source: Добавить датапак
en: Add data pack

source: Добавить датапак в мир «%@»
en: Add a data pack to world “%@”

source: Добавить с зависимостями
en: Add with Dependencies

source: Добавить…
en: Add…

source: Добавляем…
en: Adding…

source: Добро пожаловать в Hako
en: Welcome to Hako

source: Дождитесь завершения операции с файлами.
en: Wait for the file operation to finish.

source: Дождитесь завершения операций с файлами перед переименованием.
en: Wait for file operations to finish before renaming.

source: Дождитесь завершения операций с файлами сборки.
en: Wait for the instance's file operations to finish.

source: Дождитесь завершения установки Fabric.
en: Wait for Fabric to finish installing.

source: Дождитесь завершения установки сборки.
en: Wait for the instance to finish installing.

source: Дополнительные аргументы Java
en: Additional Java arguments

source: Дополнительные аргументы Minecraft
en: Additional Minecraft arguments

source: Дополнительные настройки
en: Advanced Settings

source: Доступна только альфа
en: Only alpha available

source: Доступна только бета
en: Only beta available

source: Доступны только бета и альфа
en: Only beta and alpha available

source: Другие версии
en: Other Versions

source: Другие версии «%@»
en: Other versions of “%@”

source: Дублировать
en: Duplicate

source: Если путь задан, сборки с глобальными параметрами используют эту Java вместо рекомендуемой Java внутри сборки.
en: If a path is set, instances with global parameters use this Java instead of the recommended Java inside the instance.

source: Ждём подтверждения…
en: Waiting for confirmation…

source: Журнал запуска
en: Launch Log

source: Загружаем версии…
en: Loading versions…

source: Загружаем каталог…
en: Loading catalog…

source: Загружаем параметры Mojang…
en: Loading Mojang parameters…

source: Загруженный Fabric API повреждён. Повторите загрузку.
en: The downloaded Fabric API is corrupted. Download it again.

source: Загруженный файл %@ повреждён. Повторите загрузку.
en: The downloaded file %@ is corrupted. Download it again.

source: Загруженный файл повреждён. Повторите загрузку.
en: The downloaded file is corrupted. Download it again.

source: Загрузка начнётся, когда завершится предыдущая сборка.
en: The download will start when the previous instance finishes.

source: Загрузка остановлена
en: Download paused

source: Загрузки
en: Downloads

source: Загрузчик
en: Loader

source: Загрузчик модов
en: Mod Loader

source: Закройте Minecraft перед изменением файлов сборки.
en: Quit Minecraft before changing the instance files.

source: Закройте Minecraft перед повторной установкой сборки.
en: Quit Minecraft before reinstalling the instance.

source: Закройте Minecraft.
en: Quit Minecraft.

source: Закрыть без переименования
en: Close Without Renaming

source: Заменить
en: Replace

source: Заменить датапак?
en: Replace data pack?

source: Заменить мод?
en: Replace Mod?

source: Заменить ресурспак?
en: Replace Resource Pack?

source: Занимают на диске
en: Disk usage

source: Занято
en: Used

source: Занято на диске
en: Used disk space

source: Запустить Minecraft
en: Launch Minecraft

source: Здесь появятся миры, созданные в этой сборке Minecraft.
en: Worlds created in this Minecraft instance will appear here.

source: Значения -Xmx и MaxHeapSize в аргументах заменяются лимитом ползунка при запуске.
en: -Xmx and MaxHeapSize values in the arguments are replaced by the slider limit at launch.

source: Игра
en: Game

source: Игра запущена
en: Game running

source: Играть
en: Play

source: Играть в %@
en: Play %@

source: Изменения датапаков применятся при следующем открытии мира.
en: Datapack changes will take effect the next time you open the world.

source: Изменения параметров применятся при следующем запуске игры.
en: Parameter changes will apply the next time the game launches.

source: Измените запрос или сортировку.
en: Change the search or sorting.

source: Иконка и параметры сохраняются автоматически.
en: The icon and parameters are saved automatically.

source: Иконка: %@
en: Icon: %@

source: Имя «backups» занято папкой резервных копий.
en: The name “backups” is taken by the backups folder.

source: Имя «worlds» занято папкой резервных копий миров.
en: The name “worlds” is reserved for world backups.

source: Имя в offline-mode
en: Offline mode name

source: Имя в игре
en: In-game name

source: Использовать глобальные параметры
en: Use Global Parameters

source: Использовать параметры Mojang
en: Use Mojang Parameters

source: Используются обязательные и рекомендуемые аргументы Mojang и Fabric.
en: Required and recommended Mojang and Fabric arguments are used.

source: Используются обязательные и рекомендуемые аргументы из описания версии Mojang.
en: Required and recommended arguments from the Mojang version description are used.

source: История
en: Historical

source: Итоговые аргументы запуска
en: Final Launch Arguments

source: Каталог недоступен
en: Catalog Unavailable

source: Кеш
en: Cache

source: Кеш игры пока не создан.
en: The game cache hasn't been created yet.

source: Код истёк. Получите новый и попробуйте снова.
en: The code has expired. Get a new one and try again.

source: Конфигурация Fabric отсутствует.
en: The Fabric configuration is missing.

source: Конфигурация Fabric отсутствует. Повторите установку сборки.
en: The Fabric configuration is missing. Reinstall the instance.

source: Конфликт файлов в описании версии.
en: File conflict in the version description.

source: Копируем мир…
en: Copying world…

source: Копируем сборку…
en: Copying instance…

source: Коробка
en: Box

source: Куб
en: Cube

source: Лаунчер Minecraft для macOS
en: Minecraft launcher for macOS

source: Лист
en: Leaf

source: Локальный
en: Local

source: Луна
en: Moon

source: Максимальная память Java
en: Maximum Java Memory

source: Место на диске
en: Disk Space

source: Мир «%@» и его датапаки будут перемещены в корзину.
en: World “%@” and its datapacks will be moved to the Trash.

source: Мир больше не существует. Обновите список миров.
en: The world no longer exists. Refresh the world list.

source: Мир содержит символические ссылки. Уберите их перед копированием или резервным копированием.
en: This world contains symbolic links. Remove them before copying or backing up the world.

source: Миров пока нет
en: No worlds yet

source: Миры
en: Worlds

source: Моды
en: Mods

source: Моды доступны для сборок с Fabric.
en: Mods are available for Fabric instances.

source: Моды доступны только для сборок с выбранным модлоадером.
en: Mods are only available for instances with a mod loader.

source: Моды с Modrinth
en: Mods from Modrinth

source: Моды, зависящие от Fabric API, могут больше не давать игре запуститься.
en: Mods that depend on Fabric API may prevent the game from starting.

source: Молния
en: Bolt

source: На этом аккаунте нет Minecraft: Java Edition.
en: This account doesn't own Minecraft: Java Edition.

source: Наблюдатель
en: Spectator

source: Нажмите F2 в игре — снимок появится здесь.
en: Press F2 in the game — the screenshot will appear here.

source: Назад
en: Back

source: Назад к мирам
en: Back to worlds

source: Назад к мирам (⌘[)
en: Back to worlds (⌘[)

source: Назад к сборке
en: Back to Instance

source: Назад к сборке (⌘[)
en: Back to Instance (⌘[)

source: Название
en: Name

source: Название сборки
en: Instance name

source: Название, иконка и выбранные параметры не будут сохранены.
en: The name, icon and selected parameters won't be saved.

source: Найдено несколько файлов %@. Уберите дубликаты в папке сборки.
en: Several %@ files were found. Remove the duplicates from the instance folder.

source: Найти моды на Modrinth
en: Find Mods on Modrinth

source: Найти ресурспаки на Modrinth
en: Find Resource Packs on Modrinth

source: Например, My Vanilla Pack
en: For example, My Vanilla Pack

source: Настройки
en: Settings

source: Начать
en: Get Started

source: Не задан
en: Not set

source: Не поддерживается Hako
en: Not supported by Hako

source: Не удалось восстановить очередь: %@
en: Couldn't restore the queue: %@

source: Не удалось восстановить статус игры: %@
en: Couldn't restore the game status: %@

source: Не удалось восстановить учёт времени: %@
en: Couldn't restore playtime tracking: %@

source: Не удалось выполнить действие
en: Couldn't Complete the Action

source: Не удалось запустить помощник учёта игрового времени.
en: Couldn't start the playtime tracking helper.

source: Не удалось начать установку: %@
en: Couldn't start the installation: %@

source: Не удалось начать учёт времени: %@
en: Couldn't start playtime tracking: %@

source: Не удалось открыть картинку. Выберите PNG или JPEG.
en: Couldn't open the image. Choose a PNG or JPEG.

source: Не удалось переименовать сборку
en: Couldn't Rename the Instance

source: Не удалось подготовить Java к запуску.
en: Couldn't prepare Java for launch.

source: Не удалось подготовить запуск Java (codesign, код %d).
en: Couldn't prepare the Java launch (codesign, code %d).

source: Не удалось подготовить иконку.
en: Couldn't prepare the icon.

source: Не удалось подготовить проверку Java.
en: Couldn't prepare the Java check.

source: Не удалось подобрать имя для копии мира.
en: Could not find an available name for the world copy.

source: Не удалось подобрать имя для копии сборки.
en: Couldn't find a name for the instance copy.

source: Не удалось получить данные
en: Couldn't get the data

source: Не удалось получить размер сборок.
en: Couldn't get the size of the instances.

source: Не удалось проверить выбранную Java. Выберите исполняемый файл java из папки bin.
en: Couldn't check the selected Java. Choose the java executable from the bin folder.

source: Не удалось проверить обновление Fabric API: %@
en: Couldn't check for a Fabric API update: %@

source: Не удалось проверить обновления: %@
en: Couldn't check for updates: %@

source: Не удалось прочитать Fabric API.
en: Couldn't read Fabric API.

source: Не удалось прочитать metadata Fabric API.
en: Couldn't read the Fabric API metadata.

source: Не удалось прочитать версию Fabric.
en: Couldn't read the Fabric version.

source: Не удалось прочитать игровую сессию для учёта времени.
en: Couldn't read the game session for playtime tracking.

source: Не удалось прочитать картинку.
en: Couldn't read the image.

source: Не удалось прочитать описание версии.
en: Couldn't read the version description.

source: Не удалось прочитать перетаскиваемые файлы.
en: Couldn't read the dropped files.

source: Не удалось прочитать реестр модов. Источники и обновления недоступны: %@
en: Couldn't read the mod registry. Sources and updates are unavailable: %@

source: Не удалось прочитать сведения о мире: %@
en: Could not read world information: %@

source: Не удалось прочитать ссылку описания версии.
en: Couldn't read the version description link.

source: Не удалось прочитать требование версии Fabric API: %@.
en: Couldn't read the Fabric API version requirement: %@.

source: Не удалось распаковать библиотеки игры.
en: Couldn't extract the game libraries.

source: Не удалось создать архив резервной копии (zip, код %d).
en: Couldn't create the backup archive (zip, code %d).

source: Не удалось составить запрос к Modrinth.
en: Couldn't build the Modrinth request.

source: Не удалось сохранить данные входа в Keychain (код %@).
en: Couldn't save sign-in data to the Keychain (code %@).

source: Не удалось сохранить игровое время: %@
en: Couldn't save playtime: %@

source: Не удалось сохранить иконку.
en: Couldn't save the icon.

source: Не удалось сохранить состояние сборки: %@
en: Couldn't save the instance state: %@

source: Не удалось удалить сборку
en: Couldn't Delete the Instance

source: Недопустимая папка мира.
en: Invalid world folder.

source: Недопустимая папка сборки.
en: Invalid instance folder.

source: Недопустимый путь к файлу сборки.
en: Invalid instance file path.

source: Неизвестный загрузчик модов: %@.
en: Unknown mod loader: %@.

source: Неизвестный параметр запуска Mojang: %@.
en: Unknown Mojang launch parameter: %@.
